###################################################################

# Created by write_sdc on Sat Jun 29 11:44:40 2019

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports clock]  -name core_clock  -period 5.6  -waveform {0 2.8}
set_input_delay -clock core_clock  0  [get_ports clock]
set_input_delay -clock core_clock  0  [get_ports reset]
set_input_delay -clock core_clock  0  [get_ports auto_intsink_in_sync_0]
set_input_delay -clock core_clock  0  [get_ports auto_int_in_xing_in_1_sync_0]
set_input_delay -clock core_clock  0  [get_ports auto_int_in_xing_in_0_sync_0]
set_input_delay -clock core_clock  0  [get_ports auto_int_in_xing_in_0_sync_1]
set_input_delay -clock core_clock  0  [get_ports auto_tl_slave_xing_in_a_valid]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_opcode[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_opcode[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_opcode[0]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_param[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_param[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_param[0]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_size[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_size[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_size[0]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_source[4]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_source[3]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_source[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_source[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_source[0]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[31]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[30]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[29]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[28]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[27]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[26]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[25]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[24]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[23]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[22]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[21]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[20]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[19]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[18]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[17]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[16]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[15]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[14]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[13]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[12]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[11]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[10]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[9]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[8]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[7]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[6]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[5]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[4]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[3]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_address[0]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_mask[3]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_mask[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_mask[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_mask[0]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[31]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[30]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[29]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[28]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[27]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[26]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[25]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[24]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[23]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[22]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[21]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[20]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[19]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[18]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[17]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[16]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[15]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[14]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[13]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[12]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[11]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[10]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[9]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[8]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[7]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[6]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[5]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[4]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[3]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_a_bits_data[0]}]
set_input_delay -clock core_clock  0  [get_ports auto_tl_slave_xing_in_d_ready]
set_input_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_a_ready]
set_input_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_d_valid]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_opcode[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_opcode[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_opcode[0]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_param[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_param[0]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_size[3]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_size[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_size[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_size[0]}]
set_input_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_d_bits_source]
set_input_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_d_bits_sink]
set_input_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_d_bits_denied]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[31]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[30]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[29]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[28]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[27]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[26]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[25]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[24]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[23]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[22]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[21]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[20]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[19]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[18]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[17]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[16]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[15]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[14]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[13]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[12]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[11]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[10]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[9]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[8]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[7]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[6]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[5]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[4]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[3]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[2]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[1]}]
set_input_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_d_bits_data[0]}]
set_input_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_d_bits_corrupt]
set_output_delay -clock core_clock  0  [get_ports auto_tl_slave_xing_in_a_ready]
set_output_delay -clock core_clock  0  [get_ports auto_tl_slave_xing_in_d_valid]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_opcode[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_opcode[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_opcode[0]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_param[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_param[0]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_size[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_size[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_size[0]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_source[4]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_source[3]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_source[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_source[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_source[0]}]
set_output_delay -clock core_clock  0  [get_ports auto_tl_slave_xing_in_d_bits_sink]
set_output_delay -clock core_clock  0  [get_ports auto_tl_slave_xing_in_d_bits_denied]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[31]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[30]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[29]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[28]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[27]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[26]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[25]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[24]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[23]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[22]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[21]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[20]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[19]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[18]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[17]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[16]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[15]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[14]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[13]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[12]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[11]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[10]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[9]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[8]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[7]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[6]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[5]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[4]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[3]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_slave_xing_in_d_bits_data[0]}]
set_output_delay -clock core_clock  0  [get_ports auto_tl_slave_xing_in_d_bits_corrupt]
set_output_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_a_valid]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_opcode[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_opcode[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_opcode[0]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_param[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_param[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_param[0]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_size[3]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_size[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_size[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_size[0]}]
set_output_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_a_bits_source]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[31]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[30]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[29]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[28]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[27]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[26]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[25]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[24]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[23]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[22]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[21]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[20]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[19]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[18]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[17]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[16]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[15]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[14]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[13]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[12]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[11]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[10]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[9]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[8]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[7]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[6]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[5]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[4]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[3]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_address[0]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_mask[3]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_mask[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_mask[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_mask[0]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[31]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[30]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[29]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[28]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[27]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[26]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[25]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[24]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[23]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[22]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[21]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[20]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[19]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[18]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[17]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[16]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[15]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[14]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[13]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[12]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[11]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[10]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[9]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[8]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[7]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[6]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[5]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[4]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[3]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[2]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[1]}]
set_output_delay -clock core_clock  0  [get_ports {auto_tl_master_xing_out_a_bits_data[0]}]
set_output_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_a_bits_corrupt]
set_output_delay -clock core_clock  0  [get_ports auto_tl_master_xing_out_d_ready]
